# SQL Assignment

In [1]:
import pandas as pd
import sqlite3
from IPython.display import display, HTML

In [2]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [3]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [4]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

To determine whether a year is a leap year, if year is:

(div by 4 AND not div by 100) OR div by 400


Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [5]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(100))
    print(q1_results.shape)
    assert (q1_results.shape == (232,3))

query1 =  """
select person.name,movie.title,movie.year from movie
join m_director on
movie.mid=m_director.mid
join m_genre on 
movie.mid=m_genre.mid
join genre on 
genre.gid=m_genre.gid
join person on 
person.pid=m_director.pid
where genre.name like '%Comedy%' 
and  
((CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)%4=0 and
CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)%100!=0) or
CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)%400=0)   
 
"""
grader_1(query1)

                Name                              title  year
0       Milap Zaveri                         Mastizaade  2016
1       Danny Leiner  Harold & Kumar Go to White Castle  2004
2     Anurag Kashyap                 Gangs of Wasseypur  2012
3       Frank Coraci        Around the World in 80 Days  2004
4      Griffin Dunne             The Accidental Husband  2008
..               ...                                ...   ...
95   Sunil Subramani                              Fuddu  2016
96      Mahesh Bhatt                    Papa Kahte Hain  1996
97   Shakeel Noorani                     Joru Ka Ghulam  2000
98     Prakash Mehra                           Sharaabi  1984
99      Sachin Yardi           Kyaa Super Kool Hain Hum  2012

[100 rows x 3 columns]
(232, 3)
CPU times: total: 266 ms
Wall time: 324 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [6]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(100))
    assert (q2_results.shape == (17,1)) 


query2 = """
select trim(Name) from Person 
where trim(Person.PID) in 
(select trim(M_Cast.PID) from M_Cast
join Movie on 
trim(Movie.MID)=trim(M_Cast.MID)
where Movie.title='Anand'and CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)=1971);





"""
grader_2(query2)

          trim(Name)
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
10    Brahm Bhardwaj
11      Gurnam Singh
12      Lalita Pawar
13       Durga Khote
14        Dara Singh
15     Johnny Walker
16         Moolchand
CPU times: total: 250 ms
Wall time: 270 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 ="""
select trim(PID) from M_Cast where trim(MID) in 
(select trim(MID) from Movie where 
CAST(SUBSTR(TRIM(Movie.year),-4) AS INTEGER)<1970)


"""
query_more_1990 =""" 
select trim(PID) from M_Cast where trim(MID) in 
(select trim(MID) from Movie where 
CAST(SUBSTR(TRIM(Movie.year),-4) AS INTEGER)>1990)

"""
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

In [7]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    print(q3_results.shape)
    assert (q3_results.shape == (300,1))

query3 = """ 
 select trim(PID) from M_Cast where trim(MID) in 
 (select trim(MID) from Movie where CAST(SUBSTR(TRIM(Movie.year),-4) AS INTEGER)<1970)
intersect
  select trim(PID) from M_Cast where trim(MID) in 
  (select trim(MID) from Movie where CAST(SUBSTR(TRIM(Movie.year),-4) AS INTEGER)>1990)
"""
grader_3(query3)

   trim(PID)
0  nm0000821
1  nm0003987
2  nm0004334
3  nm0004429
4  nm0004432
5  nm0004433
6  nm0004434
7  nm0004435
8  nm0004564
9  nm0004569
(300, 1)
CPU times: total: 422 ms
Wall time: 462 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [8]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    print(query_4a.shape)
    return (query_4a.shape == (58,2))

query_4a =""" 
select count(trim(movie.mid)),trim(person.name) from movie
join m_director on
trim(movie.mid)=trim(m_director.mid)
join person on
trim(person.pid)=trim(m_director.pid)
group by trim(person.name)
having count(trim(movie.mid))>=10
order by count(trim(movie.mid)) desc
"""
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

   count(trim(movie.mid))     trim(person.name)
0                      39          David Dhawan
1                      36          Mahesh Bhatt
2                      30       Ram Gopal Varma
3                      30          Priyadarshan
4                      29          Vikram Bhatt
5                      27  Hrishikesh Mukherjee
6                      21           Yash Chopra
7                      19        Shakti Samanta
8                      19       Basu Chatterjee
9                      18          Subhash Ghai
(58, 2)
True
CPU times: total: 1min 35s
Wall time: 1min 43s

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

in jupyter notebook we can use alias name to groupby but we cant use alias in postgresql

In [9]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    print(q5a_results.shape)
    assert (q5a_results.shape == (4,2))

query5a = """
SELECT CAST(SUBSTR(TRIM(Movie.year),-4) AS INTEGER) as year, COUNT(DISTINCT t1.MID) AS MoviesWithOnlyFemaleActors
FROM (
    SELECT M_Cast.MID
    FROM M_Cast
    JOIN Person ON TRIM(Person.PID) = TRIM(M_Cast.PID)
    WHERE Person.Gender = 'Female'
    EXCEPT
    SELECT M_Cast.MID
    FROM M_Cast
    JOIN Person ON TRIM(Person.PID) = TRIM(M_Cast.PID)
    WHERE Person.Gender = 'Male'
) t1
JOIN Movie ON Movie.MID = t1.MID
GROUP BY Movie.year;


"""
grader_5a(query5a)

   year  MoviesWithOnlyFemaleActors
0  1939                           1
1  1999                           1
2  2000                           1
3  2018                           1
(4, 2)
CPU times: total: 32min 11s
Wall time: 32min 48s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [5]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ 
SELECT 
    t2.Year, 
    t4.TotalMoviesPerYear,
    (MoviesWithOnlyFemaleActors*100)/TotalMoviesPerYear percentage
FROM
(
    SELECT 
        CAST(SUBSTR(TRIM(Movie.year), -4) AS INTEGER) AS Year, 
        COUNT(DISTINCT t1.MID) AS MoviesWithOnlyFemaleActors
    FROM 
        (
            SELECT M_Cast.MID
            FROM M_Cast
            JOIN Person ON TRIM(Person.PID) = TRIM(M_Cast.PID)
            WHERE Person.Gender = 'Female'
            EXCEPT
            SELECT M_Cast.MID
            FROM M_Cast
            JOIN Person ON TRIM(Person.PID) = TRIM(M_Cast.PID)
            WHERE Person.Gender = 'Male'
        ) t1
    JOIN Movie ON Movie.MID = t1.MID
    GROUP BY CAST(SUBSTR(TRIM(Movie.year), -4) AS INTEGER)
) t2
JOIN 
(
    SELECT  CAST(SUBSTR(TRIM(Movie.year), -4) AS INTEGER) as year, COUNT(DISTINCT MID) AS TotalMoviesPerYear
    FROM  movie
    WHERE Movie.year IN (1939, 1999, 2000, 2018)
    GROUP BY  CAST(SUBSTR(TRIM(Movie.year), -4) AS INTEGER)
) t4 
ON t4.Year = t2.Year;

"""
grader_5b(query5b)

   Year  TotalMoviesPerYear  percentage
0  1939                   2          50
1  1999                  66           1
2  2000                  64           1
3  2018                  93           1
CPU times: total: 32min 7s
Wall time: 13h 2min 35s

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [8]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    print(q6_results.shape)
    assert (q6_results.shape == (3473, 2))

query6 = """ 
SELECT Movie.title MovieTitle, COUNT(DISTINCT M_Cast.PID) CastSize
FROM Movie
JOIN M_Cast ON Movie.MID = M_Cast.MID
GROUP BY Movie.MID, Movie.Title
ORDER BY CastSize DESC 



"""
grader_6(query6)

                   MovieTitle  CastSize
0               Ocean's Eight       238
1                    Apaharan       233
2                        Gold       215
3             My Name Is Khan       213
4  Captain America: Civil War       191
5                    Geostorm       170
6                     Striker       165
7                        2012       154
8                      Pixels       144
9       Yamla Pagla Deewana 2       140
(3473, 2)
CPU times: user 188 ms, sys: 37.6 ms, total: 225 ms
Wall time: 242 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [23]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ 


SELECT 
    CAST((Movie.year - 1931) / 10 AS INT) AS D, 
    COUNT(DISTINCT MID) AS tm
FROM Movie
GROUP BY D
ORDER BY tm DESC
LIMIT 1;



    
    
"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

   D    tm
0  7  1011
CPU times: total: 15.6 ms
Wall time: 14.6 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

this is just to find yash chopda pid nothing else avoid error

In [6]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (228, 3))

query8 = """ 
select actor, maxcount,director from
(select actor, MAX(movies ) maxcount ,director from

(
select
actor,director,count(*)movies
from
(select distinct(trim(Person.PID))director,M_Director.MID from Person
join M_Director
on trim(M_Director.PID)=trim(Person.PID)
) t1
join
(select distinct(trim(Person.PID)) actor ,M_Cast.MID from Person
join M_cast
on trim(M_Cast.PID)=trim(Person.PID)) t2
on
trim(t1.MID)=trim(t2.MID)

group by actor,director
)


group by actor)
where director='nm0007181'
    
    
   
"""
grader_8(query8)

       actor  maxcount   director
0  nm0004434         7  nm0007181
1  nm0007181         2  nm0007181
2  nm0015296         1  nm0007181
3  nm0019463         1  nm0007181
4  nm0046230         1  nm0007181
5  nm0080385         1  nm0007181
6  nm0081070         1  nm0007181
7  nm0085944         1  nm0007181
8  nm0101508         1  nm0007181
9  nm0158332         3  nm0007181
(228, 3)
CPU times: total: 44min 51s
Wall time: 46min 4s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [4]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """

select distinct trim(p.PID) from Person p          
   JOIN M_Cast mc
   ON trim(p.PID) = trim(mc.PID) 
   where
   mc.MID in
   
(select distinct trim(mc.MID) from M_Cast mc
join Person p on 
trim(p.PID) = trim(mc.PID) 
where
   trim(p.PID) in    #srk1
   (select distinct trim(p.PID) from Person p
   JOIN M_Cast mc
   ON trim(p.PID) = trim(mc.PID) where
   mc.MID in
          (SELECT DISTINCT mc.MID  
          FROM Person p
          JOIN M_Cast mc
          ON trim(p.PID) = trim(mc.PID)  
          AND trim(p.Name) = "Shah Rukh Khan")))  
         
         
and  trim(p.PID) not in
       (select distinct trim(p.PID) from Person p
   JOIN M_Cast mc
   ON trim(p.PID) = trim(mc.PID) where
   mc.MID in
          (SELECT DISTINCT mc.MID  
          FROM Person p
          JOIN M_Cast mc
          ON trim(p.PID) = trim(mc.PID)
         AND trim(p.Name) = "Shah Rukh Khan") ) 
         


"""
grader_9(query9)

  trim(p.PID)
0   nm2951768
1   nm4575116
2   nm0949433
3   nm1753302
4   nm6467532
5   nm6071249
6   nm3491108
7   nm2539953
8   nm0922035
9   nm0324658
(25698, 1)
CPU times: user 26min 23s, sys: 44 s, total: 27min 7s
Wall time: 27min 42s